/**
 * 实验内容:
 *   (1) 用工厂方法模式设计一个电动自行车工厂的模拟程序。
 *     要求：要为每种品牌的电动自行车提供一个子工厂，如爱玛工厂专门负责生产爱玛（Aima）牌电动自行车，雅迪工厂专门负责生产雅迪（Yadea）牌电动自行车。
 *     如果今后需要生产台铃（Tailg）牌电动自行车，只需要增加一个新的台铃电动自行车工厂即可，无须修改原有代码，使得整个系统具有更强的灵活性和可扩展性。
 *   (2) 按照以上要求设计类图和编写 Java 源程序。
 *
 * 实验要求:
 *   所设计的实验程序要满足以下两点。
 *     体现“工厂方法模式”的工作原理。
 *     符合面向对象中的“开闭原则”。
 *   (1) 用 UML 设计“电动自行车工厂模拟程序”的结构图。“电动自行车工厂模拟程序”的结构图如图 bicycleFactory.jpg 所示。
 *   (2) 根据结构图写出“电动自行车工厂模拟程序”的源代码。
 *
 * 实验步骤:
 *   (1) 用 UML 设计“电动自行车工厂模拟程序”的结构图。“电动自行车工厂模拟程序”的结构图如图 bicycle.jpg 所示。
 *   (2) 根据结构图写出“电动自行车工厂模拟程序”的源代码。
 */
package org.wmc.create.factory.factoryMethod.bicycle;